Repository: moxi000/kelivo
Catalog: Kelivo-Swift/Kelivo/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# multiKeyPageDeleteSnackbarDeletedOne
source: Deleted 1 key
zh_hans: 已删除 1 个 Key
zh_hant: 已刪除 1 個 Key

# multiKeyPageDeletedErrorsSnackbar
source: Deleted %lld error keys
zh_hans: 已删除 %lld 个错误 Key
zh_hant: 已刪除 %lld 個錯誤 Key

# multiKeyPageDetect
source: Detect
zh_hans: 检测
zh_hant: 檢測

# multiKeyPageDuplicateKeyWarning
source: This key already exists
zh_hans: 该 Key 已存在
zh_hant: 該 Key 已存在

# multiKeyPageEdit
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# multiKeyPageEditAlias
source: Edit Alias
zh_hans: 编辑别名
zh_hant: 編輯別名

# multiKeyPageError
source: Error
zh_hans: 错误
zh_hant: 錯誤

# multiKeyPageImportedSnackbar
source: Imported %lld keys
zh_hans: 已导入%lld个key
zh_hant: 已匯入 %lld 個 key

# multiKeyPageNoKeys
source: No API keys
zh_hans: 暂无Key
zh_hant: 暫無 Key

# multiKeyPageNormal
source: Normal
zh_hans: 正常
zh_hant: 正常

# multiKeyPagePleaseAddModel
source: Please add a model first
zh_hans: 请先添加模型
zh_hant: 請先新增模型

# multiKeyPagePriority
source: Priority (1–10)
zh_hans: 优先级（1–10）
zh_hant: 優先級（1–10）

# multiKeyPageSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# multiKeyPageStatusActive
source: Active
zh_hans: 正常
zh_hant: 正常

# multiKeyPageStatusDisabled
source: Disabled
zh_hans: 已关闭
zh_hant: 已關閉

# multiKeyPageStatusError
source: Error
zh_hans: 错误
zh_hant: 錯誤

# multiKeyPageStatusRateLimited
source: Rate Limited
zh_hans: 限速
zh_hant: 限速

# multiKeyPageStrategyLeastUsed
source: Least Used
zh_hans: 最少使用
zh_hant: 最少使用

# multiKeyPageStrategyPriority
source: Priority
zh_hans: 优先级
zh_hant: 優先級

# multiKeyPageStrategyRandom
source: Random
zh_hans: 随机
zh_hant: 隨機

# multiKeyPageStrategyRoundRobin
source: Round Robin
zh_hans: 轮询
zh_hant: 輪詢

# multiKeyPageStrategyTitle
source: Load Balancing Strategy
zh_hans: 负载均衡策略
zh_hant: 負載平衡策略

# multiKeyPageTitle
source: Multi-Key Manager
zh_hans: 多Key管理
zh_hant: 多Key管理

# multiKeyPageTotal
source: Total
zh_hans: 总数
zh_hant: 總數

# multiKeyPageUndo
source: Undo
zh_hans: 撤回
zh_hant: 撤銷

# multiKeyPageUndoRestored
source: Restored
zh_hans: 已撤回删除
zh_hant: 已撤銷刪除

# networkProxyBypassHint
source: Comma-separated hosts/CIDR, e.g. localhost,127.0.0.1,192.168.0.0/16,*.local
zh_hans: 用逗号分隔的主机或 CIDR，例如：localhost,127.0.0.1,192.168.0.0/16,*.local
zh_hant: 以逗號分隔的主機或 CIDR，例如：localhost,127.0.0.1,192.168.0.0/16,*.local

# networkProxyBypassLabel
source: Proxy bypass
zh_hans: 代理绕过
zh_hant: 代理繞過

# networkProxyEnableLabel
source: Enable Proxy
zh_hans: 启动代理
zh_hant: 啟動代理

# networkProxyNoUrl
source: Please enter a URL
zh_hans: 请输入测试地址
zh_hant: 請輸入測試地址

# networkProxyOptionalHint
source: Optional
zh_hans: 可选
zh_hant: 可選

# networkProxyPassword
source: Password
zh_hans: 密码
zh_hant: 密碼

# networkProxyPort
source: Port
zh_hans: 端口
zh_hant: 連接埠

# networkProxyPriorityNote
source: When both global and provider proxies are enabled, provider-level proxy takes priority.
zh_hans: 当同时开启全局代理与供应商代理时，将优先使用供应商代理。
zh_hant: 同時啟用全域代理與供應商代理時，將優先使用供應商代理。

# networkProxyServerHost
source: Server
zh_hans: 服务器地址
zh_hant: 伺服器地址

# networkProxySettingsHeader
source: Proxy Settings
zh_hans: 代理设置
zh_hant: 代理設定

# networkProxyTestButton
source: Test
zh_hans: 测试
zh_hant: 測試

# networkProxyTestFailed
source: Test failed: %@
zh_hans: 测试失败：%@
zh_hant: 測試失敗：%@

# networkProxyTestHeader
source: Connection Test
zh_hans: 连接测试
zh_hant: 連線測試

# networkProxyTestSuccess
source: Connection successful
zh_hans: 连接成功
zh_hant: 連線成功

# networkProxyTestUrlHint
source: Test URL
zh_hans: 测试地址
zh_hant: 測試地址

# networkProxyTesting
source: Testing…
zh_hans: 测试中…
zh_hant: 測試中…

# networkProxyType
source: Proxy Type
zh_hans: 代理类型
zh_hant: 代理類型

# networkProxyUsername
source: Username
zh_hans: 用户名
zh_hant: 使用者名稱

# notificationChatCompletedBody
source: Assistant reply has been generated
zh_hans: 助手回复已生成
zh_hant: 助手回覆已生成

# notificationChatCompletedTitle
source: Generation complete
zh_hans: 生成完成
zh_hant: 生成完成

# openSystemSettings
source: Open Settings
zh_hans: 去设置
zh_hant: 前往設定

# providerDetailPageAddGroupTooltip
source: Add group
zh_hans: 添加本组
zh_hant: 新增本組

# providerDetailPageAddNewModelButton
source: Add Model
zh_hans: 添加新模型
zh_hant: 新增新模型

# providerDetailPageAihubmixAppCodeHelp
source: Adds header APP-Code requests to get a 10% discount. Only affects AIhubmix.
zh_hans: 为请求附加 APP-Code，可享 10% 优惠，仅对 AIhubmix 生效。
zh_hant: 為請求附加 APP-Code，可享 10% 優惠，僅對 AIhubmix 生效。

# providerDetailPageAihubmixAppCodeLabel
source: APP-Code (10% off)
zh_hans: 应用 Code（享 10% 优惠）
zh_hant: 應用 Code（享 10% 優惠）

# providerDetailPageApiKeyHint
source: Leave empty to use default
zh_hans: 留空则使用上层默认
zh_hant: 留空則使用上層預設

# providerDetailPageApiPathLabel
source: API Path
zh_hans: API 路径
zh_hant: API 路徑

# providerDetailPageBatchDetectButton
source: Detect
zh_hans: 检测
zh_hant: 檢測

# providerDetailPageBatchDetectStart
source: Start Detection
zh_hans: 开始检测
zh_hant: 開始檢測

# providerDetailPageBatchDetecting
source: Detecting...
zh_hans: 检测中...
zh_hant: 檢測中...

# providerDetailPageCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# providerDetailPageCapsImage
source: Image
zh_hans: 生图
zh_hant: 生圖

# providerDetailPageCapsReasoning
source: Reasoning
zh_hans: 推理
zh_hant: 推理

# providerDetailPageCapsTool
source: Tool
zh_hans: 工具
zh_hant: 工具

# providerDetailPageCapsVision
source: Vision
zh_hans: 视觉
zh_hant: 視覺

# providerDetailPageChangeButton
source: Change
zh_hans: 更换
zh_hant: 更換

# providerDetailPageConfigTab
source: Config
zh_hans: 配置
zh_hant: 設定

# providerDetailPageConfirmDeleteContent
source: This can be undone via Undo. Delete?
zh_hans: 删除后可通过撤销恢复。是否删除？
zh_hant: 刪除後可透過撤銷還原。是否刪除？

# providerDetailPageConfirmDeleteTitle
source: Confirm Delete
zh_hans: 确认删除
zh_hant: 確認刪除

# providerDetailPageDeleteAllModelsWarning
source: This action cannot be undone.
zh_hans: 此操作不可撤回
zh_hant: 此操作不可撤回

# providerDetailPageDeleteButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# providerDetailPageDeleteModelButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# providerDetailPageDeleteProviderContent
source: Are you sure you want to delete this provider? This cannot be undone.
zh_hans: 确定要删除该供应商吗？此操作不可撤销。
zh_hant: 確定要刪除該供應商嗎？此操作不可撤銷。

# providerDetailPageDeleteProviderTitle
source: Delete Provider
zh_hans: 删除供应商
zh_hant: 刪除供應商

# providerDetailPageDeleteProviderTooltip
source: Delete Provider
zh_hans: 删除供应商
zh_hant: 刪除供應商

# providerDetailPageDeleteText
source: Delete
zh_hans: 删除
zh_hant: 刪除

# providerDetailPageDetectFailed
source: Detection failed
zh_hans: 检测失败
zh_hant: 檢測失敗

# providerDetailPageDetectSuccess
source: Detection successful
zh_hans: 检测成功
zh_hant: 檢測成功

# providerDetailPageEditTooltip
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# providerDetailPageEmbeddingsGroupTitle
source: Embeddings
zh_hans: 嵌入
zh_hant: 嵌入

# providerDetailPageEnableProxyTitle
source: Enable Proxy
zh_hans: 是否启用代理
zh_hant: 是否啟用代理

# providerDetailPageEnabledTitle
source: Enabled
zh_hans: 是否启用
zh_hant: 是否啟用

# providerDetailPageFetchModelsButton
source: Fetch
zh_hans: 获取
zh_hant: 取得

# providerDetailPageFilterHint
source: Type model name to filter
zh_hans: 输入模型名称筛选
zh_hant: 輸入模型名稱篩選

# providerDetailPageHideTooltip
source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

# providerDetailPageHostLabel
source: Host
zh_hans: 主机地址
zh_hant: 主機地址

# providerDetailPageImportJsonButton
source: Import JSON
zh_hans: 导入 JSON
zh_hant: 匯入 JSON

# providerDetailPageLocationLabel
source: Location
zh_hans: 区域 Location
zh_hant: 區域 Location

# providerDetailPageManageKeysButton
source: Manage Keys
zh_hans: 多Key管理
zh_hant: 多Key管理

# providerDetailPageManageSectionTitle
source: Manage
zh_hans: 管理
zh_hant: 管理

# providerDetailPageModelDeletedSnackbar
source: Model deleted
zh_hans: 已删除模型
zh_hant: 已刪除模型

# providerDetailPageModelsTab
source: Models
zh_hans: 模型
zh_hant: 模型

# providerDetailPageModelsTitle
source: Models
zh_hans: 模型
zh_hant: 模型

# providerDetailPageMultiKeyModeTitle
source: Multi-Key Mode
zh_hans: 多Key模式
zh_hant: 多Key模式

# providerDetailPageNameLabel
source: Name
zh_hans: 名称
zh_hant: 名稱

# providerDetailPageNetworkTab
source: Network
zh_hans: 网络代理
zh_hant: 網路代理

# providerDetailPageNoModelsSubtitle
source: Tap the buttons below to add models
zh_hans: 点击下方按钮添加模型
zh_hant: 點擊下方按鈕新增模型

# providerDetailPageNoModelsTitle
source: No Models
zh_hans: 暂无模型
zh_hant: 暫無模型

# providerDetailPageOtherModelsGroupTitle
source: Other
zh_hans: 其他模型
zh_hant: 其他模型

# providerDetailPagePasswordOptionalLabel
source: Password (optional)
zh_hans: 密码（可选）
zh_hant: 密碼（可選）

# providerDetailPagePortLabel
source: Port
zh_hans: 端口
zh_hant: 連接埠

# providerDetailPageProjectIdLabel
source: Project ID
zh_hans: 项目 ID
zh_hant: 專案 ID

# providerDetailPageProviderDeletedSnackbar
source: Provider deleted
zh_hans: 已删除供应商
zh_hant: 已刪除供應商

# providerDetailPageProviderRemovedMessage
source: Provider removed
zh_hans: 供应商已删除
zh_hant: 供應商已刪除

# providerDetailPageProviderTypeTitle
source: Provider Type
zh_hans: 供应商类型
zh_hant: 供應商類型

# providerDetailPageRemoveGroupTooltip
source: Remove group
zh_hans: 移除本组
zh_hant: 移除本組

# providerDetailPageSaveButton
source: Save
zh_hans: 保存
zh_hant: 儲存

# providerDetailPageSavedSnackbar
source: Saved
zh_hans: 已保存
zh_hant: 已儲存

# providerDetailPageSelectModelButton
source: Select Model
zh_hans: 选择模型
zh_hant: 選擇模型

# providerDetailPageServiceAccountJsonLabel
source: Service Account JSON (paste or import)
zh_hans: 服务账号 JSON（粘贴或导入）
zh_hant: 服務帳號 JSON（貼上或匯入）

# providerDetailPageShareTooltip
source: Share
zh_hans: 分享
zh_hant: 分享

# providerDetailPageShowTooltip
source: Show
zh_hans: 显示
zh_hant: 顯示

# providerDetailPageTestButton
source: Test
zh_hans: 测试
zh_hant: 測試

# providerDetailPageTestConnectionTitle
source: Test Connection
zh_hans: 测试连接
zh_hant: 測試連線

# providerDetailPageTestSuccessMessage
source: Success
zh_hans: 测试成功
zh_hant: 測試成功

# providerDetailPageTestingMessage
source: Testing…
zh_hans: 正在测试…
zh_hant: 正在測試…

# providerDetailPageUndoButton
source: Undo
zh_hans: 撤销
zh_hant: 撤銷

# providerDetailPageUseStreamingLabel
source: Use Streaming
zh_hans: 使用流式
zh_hant: 使用串流

# providerDetailPageUsernameOptionalLabel
source: Username (optional)
zh_hans: 用户名（可选）
zh_hant: 使用者名稱（可選）

# providerGroupsCreateDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# providerGroupsCreateDialogOk
source: Create
zh_hans: 创建
zh_hant: 建立

# providerGroupsCreateDialogTitle
source: New group
zh_hans: 新建分组
zh_hant: 新增分組

# providerGroupsCreateFailedToast
source: Failed to create group
zh_hans: 创建分组失败
zh_hant: 建立分組失敗

# providerGroupsCreateNewGroupAction
source: New group…
zh_hans: 新建分组…
zh_hant: 新增分組…

# providerGroupsDeleteConfirmCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# providerGroupsDeleteConfirmContent
source: Providers in this group will be moved to “Other”.
zh_hans: 该组内供应商将移动到「其他」
zh_hant: 該組內供應商將移動到「其他」

# providerGroupsDeleteConfirmOk
source: Delete
zh_hans: 删除
zh_hant: 刪除

# providerGroupsDeleteConfirmTitle
source: Delete group?
zh_hans: 删除分组
zh_hant: 刪除分組

# providerGroupsDeletedToast
source: Group deleted
zh_hans: 已删除分组
zh_hant: 已刪除分組

# providerGroupsEmptyState
source: No groups yet.
zh_hans: 暂无分组
zh_hant: 暫無分組

# providerGroupsExpandToMoveToast
source: Please expand the group first.
zh_hans: 请先展开分组
zh_hant: 請先展開分組

# providerGroupsGroupLabel
source: Group
zh_hans: 分组
zh_hant: 分組

# providerGroupsManageAction
source: Manage groups
zh_hans: 管理分组
zh_hant: 管理分組

# providerGroupsManageTitle
source: Manage groups
zh_hans: 分组管理
zh_hant: 分組管理

# providerGroupsNameHint
source: Group name
zh_hans: 输入分组名称
zh_hant: 輸入分組名稱

# providerGroupsOther
source: Other
zh_hans: 其他
zh_hant: 其他

# providerGroupsOtherUngroupedOption
source: Other (Ungrouped)
zh_hans: 其他（未分组）
zh_hant: 其他（未分組）

# providerGroupsPickerTitle
source: Select group
zh_hans: 选择分组
zh_hant: 選擇分組

# providerModelsGetButton
source: Get
zh_hans: 获取
zh_hant: 取得

# providersPageAddTooltip
source: Add
zh_hans: 新增
zh_hant: 新增

# providersPageAliyunName
source: Aliyun
zh_hans: 阿里云千问
zh_hant: 阿里雲千問

# providersPageByteDanceName
source: ByteDance
zh_hans: 火山引擎
zh_hant: 火山引擎

# providersPageDeleteAction
source: Delete
zh_hans: 删除
zh_hant: 刪除

# providersPageDeleteSelectedConfirmContent
source: Delete selected providers? This cannot be undone.
zh_hans: 确定要删除选中的供应商吗？该操作不可撤销。
zh_hant: 確定要刪除選中的供應商嗎？此操作不可撤銷。

# providersPageDeleteSelectedSnackbar
source: Deleted selected providers
zh_hans: 已删除选中的供应商
zh_hant: 已刪除選中的供應商

# providersPageDisabledStatus
source: OFF
zh_hans: 禁用
zh_hant: 停用

# providersPageEnabledStatus
source: ON
zh_hans: 启用
zh_hant: 啟用

# providersPageExportAction
source: Export
zh_hans: 导出
zh_hant: 匯出

# providersPageExportCopiedSnackbar
source: Copied export code
zh_hans: 已复制导出代码
zh_hant: 已複製匯出代碼

# providersPageExportCopyButton
source: Copy
zh_hans: 复制
zh_hant: 複製

# providersPageExportSelectedTitle
source: Export %lld providers
zh_hans: 导出 %lld 个供应商
zh_hant: 匯出 %lld 個供應商

# providersPageExportShareButton
source: Share
zh_hans: 分享
zh_hant: 分享

# providersPageImportTooltip
source: Import
zh_hans: 导入
zh_hant: 匯入

# providersPageModelsCountSingleSuffix
source: models
zh_hans: 个模型
zh_hant: 個模型

# providersPageMultiSelectTooltip
source: Multi-select
zh_hans: 多选
zh_hant: 多選

# providersPageProviderAddedSnackbar
source: Provider added
zh_hans: 已添加供应商
zh_hant: 已新增供應商

# providersPageSearchHint
source: Search providers or groups
zh_hans: 搜索供应商或分组

# providersPageSiliconFlowName
source: SiliconFlow
zh_hans: 硅基流动
zh_hant: 矽基流動

# providersPageTitle
source: Providers
zh_hans: 供应商
zh_hant: 供應商

# providersPageZhipuName
source: Zhipu AI
zh_hans: 智谱
zh_hant: 智譜

# qrScanPageInstruction
source: Align the QR code within the frame
zh_hans: 将二维码对准取景框
zh_hant: 將QR Code對準取景框

# qrScanPageTitle
source: Scan QR
zh_hans: 扫码导入
zh_hant: 掃碼匯入

# quickPhraseAddTitle
source: Add Quick Phrase
zh_hans: 添加快捷短语
zh_hant: 新增快捷片語

# quickPhraseAddTooltip
source: Add Quick Phrase
zh_hans: 添加快捷短语
zh_hant: 新增快捷片語

# quickPhraseAssistantTitle
source: Assistant Quick Phrase
zh_hans: 助手快捷短语
zh_hant: 助理快捷片語

# quickPhraseBackTooltip
source: Back
zh_hans: 返回
zh_hant: 返回

# quickPhraseCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# quickPhraseContentLabel
source: Content
zh_hans: 内容
zh_hant: 內容

# quickPhraseDeleteButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# quickPhraseEditButton
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# quickPhraseEditTitle
source: Edit Quick Phrase
zh_hans: 编辑快捷短语
zh_hant: 編輯快捷片語

# quickPhraseEmptyMessage
source: No quick phrases yet
zh_hans: 暂无快捷短语
zh_hant: 暫無快捷片語

# quickPhraseGlobalTitle
source: Quick Phrase
zh_hans: 快捷短语
zh_hant: 快捷片語

# quickPhraseMenuTitle
source: Quick Phrase
zh_hans: 快捷短语
zh_hant: 快捷片語

# quickPhraseSaveButton
source: Save
zh_hans: 保存
zh_hant: 儲存

# quickPhraseTitleLabel
source: Title
zh_hans: 标题
zh_hant: 標題

# reasoningBudgetSheetAuto
source: Auto
zh_hans: 自动
zh_hant: 自動

# reasoningBudgetSheetAutoSubtitle
source: Let the model decide reasoning level automatically
zh_hans: 由模型自动决定推理级别
zh_hant: 由模型自動決定推理級別

# reasoningBudgetSheetCurrentLevel
source: Current Level: %@
zh_hans: 当前档位：%@
zh_hant: 目前檔位：%@

# reasoningBudgetSheetCustomHint
source: e.g. 2048 (-1 auto, 0 off)
zh_hans: 例如：2048 (-1 自动，0 关闭)
zh_hant: 例如：2048 (-1 自動，0 關閉)

# reasoningBudgetSheetCustomLabel
source: Custom Reasoning Budget (tokens)
zh_hans: 自定义推理预算 (tokens)
zh_hant: 自訂推理預算 (tokens)

# reasoningBudgetSheetHeavy
source: Heavy Reasoning
zh_hans: 重度推理
zh_hant: 重度推理

# reasoningBudgetSheetHeavySubtitle
source: Use heavy reasoning for complex questions
zh_hans: 使用大量推理来回答问题，适合复杂问题
zh_hant: 使用大量推理來回答問題，適合複雜問題

# reasoningBudgetSheetLight
source: Light Reasoning
zh_hans: 轻度推理
zh_hant: 輕度推理

# reasoningBudgetSheetLightSubtitle
source: Use light reasoning to answer questions
zh_hans: 使用少量推理来回答问题
zh_hant: 使用少量推理來回答問題

# reasoningBudgetSheetMedium
source: Medium Reasoning
zh_hans: 中度推理
zh_hant: 中度推理

# reasoningBudgetSheetMediumSubtitle
source: Use moderate reasoning to answer questions
zh_hans: 使用较多推理来回答问题
zh_hant: 使用較多推理來回答問題

# reasoningBudgetSheetOff
source: Off
zh_hans: 关闭
zh_hant: 關閉

# reasoningBudgetSheetOffSubtitle
source: Turn off reasoning, answer directly
zh_hans: 关闭推理功能，直接回答
zh_hant: 關閉推理功能，直接回答

# reasoningBudgetSheetTitle
source: Reasoning Chain Strength
zh_hans: 思维链强度
zh_hant: 思維鏈強度

# reasoningBudgetSheetXhigh
source: Extreme Reasoning
zh_hans: 极限推理
zh_hant: 極限推理

# reasoningBudgetSheetXhighSubtitle
source: Use maximum reasoning depth for the toughest problems
zh_hans: 使用最大推理深度，适合最复杂的问题
zh_hant: 使用最大推理深度，適合最複雜的問題

# requestLogSettingSubtitle
source: When enabled, request/response details are written to logs/logs.txt (rotated daily).
zh_hans: 开启后会将请求/响应详情写入 logs/logs.txt
zh_hant: 開啟後會將請求/回應詳細寫入 logs/logs.txt

# requestLogSettingTitle
source: Request Logging
zh_hans: 请求日志打印
zh_hant: 請求日誌列印

# searchProviderBingLocalDescription
source: Uses web scraping to fetch Bing results. No API key required; may be unstable.
zh_hans: 使用网络抓取工具获取必应搜索结果。无需 API 密钥，但可能不够稳定。
zh_hant: 使用網路抓取工具取得 Bing 搜尋結果。無需 API 金鑰，但可能不夠穩定。

# searchProviderBochaDescription
source: Bocha web search API. Accurate web results with optional summaries.
zh_hans: 博查 AI 全网网页搜索，支持时间范围与摘要，更适合 AI 使用。
zh_hant: 博查 AI 全網網頁搜尋，支援時間範圍與摘要，更適合 AI 使用。

# searchProviderBraveDescription
source: Independent search engine by Brave. Privacy-focused with no tracking or profiling.
zh_hans: Brave 独立搜索引擎。注重隐私，无跟踪或画像。
zh_hant: Brave 獨立搜尋引擎。注重隱私，無追蹤或建立個人檔案。

# searchProviderDuckDuckGoDescription
source: Privacy-focused DuckDuckGo search via DDGS. No API key required; supports region selection.
zh_hans: 基于 DDGS 的 DuckDuckGo 隐私搜索，无需 API 密钥，支持设置地区。
zh_hant: 基於 DDGS 的 DuckDuckGo 隱私搜尋，無需 API 金鑰，支援設定地區。

# searchProviderExaDescription
source: Neural search with semantic understanding. Great for research and finding specific content.
zh_hans: 具备语义理解的神经搜索引擎。适合研究与查找特定内容。
zh_hant: 具備語義理解的神經搜尋引擎。適合研究與查找特定內容。

# searchProviderJinaDescription
source: AI search foundation with embeddings, rerankers, web reader, deepsearch, and small language models. Multilingual and multimodal.
zh_hans: 适合开发者和企业用于 AI 搜索应用。支持多语言与多模态。
zh_hant: AI 搜尋基礎設施：提供 Embeddings、重排序、Web Reader、DeepSearch 與小語言模型。支援多語言與多模態。

# searchProviderLinkUpDescription
source: Search API with sourced answers. Provides both results and AI-generated summaries.
zh_hans: 提供来源可追溯答案的搜索 API，同时提供搜索结果与 AI 摘要。
zh_hant: 提供來源可追溯答案的搜尋 API，同時提供搜尋結果與 AI 摘要。

# searchProviderMetasoDescription
source: Chinese search by Metaso. Optimized for Chinese content with AI capabilities.
zh_hans: 秘塔中文搜索引擎。面向中文内容优化并提供 AI 能力。
zh_hant: 秘塔中文搜尋引擎。針對中文內容優化並提供 AI 能力。

# searchProviderOllamaDescription
source: Ollama web search API. Augments models with up-to-date information.
zh_hans: Ollama 网络搜索 API。为模型补充最新信息，减少幻觉并提升准确性。
zh_hant: Ollama 網路搜尋 API。為模型補充最新資訊，降低幻覺並提升準確性。

# searchProviderPerplexityDescription
source: Perplexity Search API. Ranked web results with region and domain filters.
zh_hans: Perplexity 搜索 API。提供排序的网页结果，支持区域与域名过滤。
zh_hant: Perplexity 搜尋 API。提供排序的網頁結果，支援地區與網域過濾。

# searchProviderSearXNGDescription
source: Privacy-respecting metasearch engine. Self-hosted instance required; no tracking.
zh_hans: 注重隐私的元搜索引擎。需自建实例，无跟踪。
zh_hant: 重視隱私的元搜尋引擎。需自建實例，無追蹤。

# searchProviderTavilyDescription
source: AI search API optimized for LLMs. Provides high-quality, relevant results.
zh_hans: 为大型语言模型（LLMs）优化的 AI 搜索 API，提供高质量、相关的搜索结果。
zh_hant: 為大型語言模型（LLM）優化的 AI 搜尋 API，提供高品質、相關的搜尋結果。

# searchProviderZhipuDescription
source: Chinese AI search by Zhipu AI. Optimized for Chinese content and queries.
zh_hans: 智谱 AI 旗下中文 AI 搜索服务，针对中文内容与查询进行了优化。
zh_hant: 智譜 AI 旗下中文 AI 搜尋服務，針對中文內容與查詢進行優化。

# searchServiceNameBocha
source: Bocha
zh_hans: 博查
zh_hant: 博查

# searchServiceNameBrave
source: Brave Search
zh_hans: Brave
zh_hant: Brave 搜尋

# searchServiceNameMetaso
source: Metaso
zh_hans: 秘塔
zh_hant: Metaso（秘塔）

# searchServiceNameZhipu
source: Zhipu AI
zh_hans: 智谱
zh_hant: Zhipu（智譜）

# searchServicesAddDialogAdd
source: Add
zh_hans: 添加
zh_hant: 新增

# searchServicesAddDialogApiKeyRequired
source: API Key is required
zh_hans: API Key 必填
zh_hant: API Key 必填

# searchServicesAddDialogBingLocal
source: Local
zh_hans: 本地
zh_hant: 本機

# searchServicesAddDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# searchServicesAddDialogEnginesOptional
source: Engines (optional)
zh_hans: 搜索引擎（可选）
zh_hant: 搜尋引擎（可選）

# searchServicesAddDialogInstanceUrl
source: Instance URL
zh_hans: 实例 URL
zh_hant: 實例 URL

# searchServicesAddDialogLanguageOptional
source: Language (optional)
zh_hans: 语言（可选）
zh_hant: 語言（可選）

# searchServicesAddDialogPasswordOptional
source: Password (optional)
zh_hans: 密码（可选）
zh_hant: 密碼（可選）

# searchServicesAddDialogRegionOptional
source: Region (optional, default: us-en)
zh_hans: 地区（可选，默认 us-en）
zh_hant: 地區（可選，預設 us-en）

# searchServicesAddDialogServiceType
source: Service Type
zh_hans: 服务类型
zh_hant: 服務類型

# searchServicesAddDialogTitle
source: Add Search Service
zh_hans: 添加搜索服务
zh_hant: 新增搜尋服務

# searchServicesAddDialogUrlRequired
source: URL is required
zh_hans: URL 必填
zh_hant: URL 必填

# searchServicesAddDialogUsernameOptional
source: Username (optional)
zh_hans: 用户名（可选）
zh_hant: 使用者名稱（可選）

# searchServicesEditDialogApiKeyRequired
source: API Key is required
zh_hans: API Key 必填
zh_hant: API Key 必填

# searchServicesEditDialogBingLocalNoConfig
source: No configuration required for Bing Local search.
zh_hans: Bing 本地搜索不需要配置。
zh_hant: Bing 本機搜尋不需要設定。

# searchServicesEditDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# searchServicesEditDialogEdit
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# searchServicesEditDialogEnginesOptional
source: Engines (optional)
zh_hans: 搜索引擎（可选）
zh_hant: 搜尋引擎（可選）

# searchServicesEditDialogInstanceUrl
source: Instance URL
zh_hans: 实例 URL
zh_hant: 實例 URL

# searchServicesEditDialogLanguageOptional
source: Language (optional)
zh_hans: 语言（可选）
zh_hant: 語言（可選）

# searchServicesEditDialogPasswordOptional
source: Password (optional)
zh_hans: 密码（可选）
zh_hant: 密碼（可選）

# searchServicesEditDialogRegionOptional
source: Region (optional, default: us-en)
zh_hans: 地区（可选，默认 us-en）
zh_hant: 地區（可選，預設 us-en）

# searchServicesEditDialogSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# searchServicesEditDialogUrlRequired
source: URL is required
zh_hans: URL 必填
zh_hant: URL 必填

# searchServicesEditDialogUsernameOptional
source: Username (optional)
zh_hans: 用户名（可选）
zh_hant: 使用者名稱（可選）

# searchServicesFieldCustomUrlOptional
source: Custom URL (optional)
zh_hans: 自定义 URL（可选）
zh_hant: 自訂 URL（可選）

# searchServicesPageAddProvider
source: Add Provider
zh_hans: 添加提供商
zh_hant: 新增提供商

# searchServicesPageApiKeyRequiredStatus
source: API Key Required
zh_hans: 需要 API Key
zh_hant: 需要 API Key

# searchServicesPageAtLeastOneServiceRequired
source: At least one search service is required
zh_hans: 至少需要一个搜索服务
zh_hant: 至少需要一個搜尋服務

# searchServicesPageAutoTestTitle
source: Auto-test connections on launch
zh_hans: 启动时自动测试连接
zh_hant: 啟動時自動測試連線

# searchServicesPageBackTooltip
source: Back
zh_hans: 返回
zh_hant: 返回

# searchServicesPageConfiguredStatus
source: Configured
zh_hans: 已配置
zh_hant: 已設定

# searchServicesPageConnectedStatus
source: Connected
zh_hans: 已连接
zh_hant: 已連線

# searchServicesPageDeleteServiceTooltip
source: Delete Service
zh_hans: 删除服务
zh_hant: 刪除服務

# searchServicesPageDone
source: Done
zh_hans: 完成
zh_hant: 完成

# searchServicesPageEdit
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# searchServicesPageEditServiceTooltip
source: Edit Service
zh_hans: 编辑服务
zh_hant: 編輯服務

# searchServicesPageFailedStatus
source: Failed
zh_hans: 连接失败
zh_hant: 連線失敗

# searchServicesPageGeneralOptions
source: General Options
zh_hans: 通用选项
zh_hant: 通用選項

# searchServicesPageMaxResults
source: Max Results
zh_hans: 最大结果数
zh_hant: 最大結果數

# searchServicesPageNotTestedStatus
source: Not tested
zh_hans: 未测试
zh_hant: 未測試

# searchServicesPageSearchProviders
source: Search Providers
zh_hans: 搜索提供商
zh_hant: 搜尋提供商

# searchServicesPageTestConnectionTooltip
source: Test Connection
zh_hans: 测试连接
zh_hant: 測試連線

# searchServicesPageTestingStatus
source: Testing…
zh_hans: 测试中…
zh_hant: 測試中…
